sorosaulong-ux/gd32-test-project/Library/gd32a7xx_pmu.c
/*!
    \file    gd32a7xx_pmu.c
    \brief   PMU driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_pmu.h"

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      enable final step regulator (API_ID: 0x0001U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_run_ldo_enable(void)
{
    PMU_CFG |= PMU_CFG_FSREN;
}

/*!
    \brief      disable final step regulator (API_ID: 0x0002U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_run_ldo_disable(void)
{
    PMU_CFG &= ~PMU_CFG_FSREN;
}

/*!
    \brief      enable final step regulator auto truns over (API_ID: 0x0003U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_run_ldo_auto_switch_enable(void)
{
    PMU_CFG |= PMU_CFG_FSRATO;
}

/*!
    \brief      disable final step regulator auto truns over (API_ID: 0x0004U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_run_ldo_auto_switch_disable(void)
{
    PMU_CFG &= ~PMU_CFG_FSRATO;
}

/*!
    \brief      enable final step regulator base control (API_ID: 0x0005U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_base_control_enable(void)
{
    PMU_CFG |= PMU_CFG_FSRCTLEN;
}

/*!
    \brief      disable final step regulator base control (API_ID: 0x0006U) 
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_base_control_disable(void)
{
    PMU_CFG &= ~PMU_CFG_FSRCTLEN;
}

/*!
    \brief      disable final step regulator and final step regulator base control simultaneously (API_ID: 0x0007U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_run_ldo_and_base_control_disable(void)
{
    PMU_CFG &= ~(PMU_CFG_FSREN | PMU_CFG_FSRCTLEN);
}

/*!
    \brief      enable fast recovery from LCM (API_ID: 0x0008U) 
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_fast_recovery_enable(void)
{
    PMU_CFG |= PMU_CFG_FREC;
}

/*!
    \brief      disable fast recovery from LCM (API_ID: 0x0009U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_fast_recovery_disable(void)
{
    PMU_CFG &= ~PMU_CFG_FREC;
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      enable PMU LVD (API_ID(0x000aU))
    \param[in]  pmu_domain: PMU LVD domain
                only one parameter can be selected which is shown as below:
      \arg        PMU_V25_DOMAIN: V25 domain
      \arg        PMU_VDDB_DOMAIN: VDDB domain
    \param[out] none
    \retval     none
*/
void pmu_lvd_enable(uint32_t pmu_domain)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_DOMAIN(pmu_domain)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x000aU), ERR_PARAM_INVALID);
    }else 
#endif
    {
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        if(PMU_V25_DOMAIN == pmu_domain){
            PMU_CFG |= PMU_CFG_V25LVRDEN;
        }else{
            PMU_CFG |= PMU_CFG_VBLVRDEN;
        }
#else
        PMU_CFG |= PMU_CFG_V25LVRDEN;
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    }
}

/*!
    \brief      disable PMU LVD (API_ID(0x000bU))
    \param[in]  pmu_domain: PMU LVD domain
                only one parameter can be selected which is shown as below:
      \arg        PMU_V25_DOMAIN: V25 domain
      \arg        PMU_VDDB_DOMAIN: VDDB domain
    \param[out] none
    \retval     none
*/
void pmu_lvd_disable(uint32_t pmu_domain)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_DOMAIN(pmu_domain)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x000bU), ERR_PARAM_INVALID);
    }else
#endif
    {
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        if(PMU_V25_DOMAIN == pmu_domain){
            PMU_CFG &= ~PMU_CFG_V25LVRDEN;
        }else{
            PMU_CFG &= ~PMU_CFG_VBLVRDEN;
        }
#else
        PMU_CFG &= ~PMU_CFG_V25LVRDEN;
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
    }
}

/*!
    \brief      enable temperature monitor (API_ID(0x000cU))
    \param[in]  temp_monitor: temperature monitor number
                only one parameter can be selected which is shown as below:
      \arg        PMU_TEMPERATURE_MONITOR_0: temperature monitor 0
      \arg        PMU_TEMPERATURE_MONITOR_1: temperature monitor 1
    \param[out] none
    \retval     none
*/
void pmu_temperature_monitor_enable(uint32_t temp_monitor)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_TEMPERATURE_MONITOR(temp_monitor)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x000cU), ERR_PARAM_INVALID);
    }else
#endif
    {
        if(PMU_TEMPERATURE_MONITOR_0 == temp_monitor){
            PMU_CFG |= PMU_CFG_TEMP0EN;
        }else{
            PMU_CFG |= PMU_CFG_TEMP1EN;
        }
    }
}

/*!
    \brief      disable temperature monitor (API_ID(0x000dU))
    \param[in]  temp_monitor: temperature monitor number
                only one parameter can be selected which is shown as below:
      \arg        PMU_TEMPERATURE_MONITOR_0: temperature monitor 0
      \arg        PMU_TEMPERATURE_MONITOR_1: temperature monitor 1
    \param[out] none
    \retval     none
*/
void pmu_temperature_monitor_disable(uint32_t temp_monitor)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_TEMPERATURE_MONITOR(temp_monitor)) {
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x000dU), ERR_PARAM_INVALID);
    }else
#endif
    {
        if(PMU_TEMPERATURE_MONITOR_0 == temp_monitor){
            PMU_CFG &= ~PMU_CFG_TEMP0EN;
        }else{
            PMU_CFG &= ~PMU_CFG_TEMP1EN;
        }
    }
}

/*!
    \brief      select temperature monitor threshold (API_ID(0x000eU))
    \param[in]  temp_monitor: temperature monitor number
                only one parameter can be selected which is shown as below:
      \arg        PMU_TEMPERATURE_MONITOR_0: temperature monitor 0
      \arg        PMU_TEMPERATURE_MONITOR_1: temperature monitor 1
    \param[in]  temp_level: temperature monitor threshold
                only one parameter can be selected which is shown as below:
      \arg        PMU_TEMPERATURE_LEVEL_145: temperature threshold around 145
      \arg        PMU_TEMPERATURE_LEVEL_155: temperature threshold around 155
    \param[out] none
    \retval     none
*/
void pmu_temperature_level_select(uint32_t temp_monitor, uint32_t temp_level)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_TEMPERATURE_MONITOR(temp_monitor)){
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x000eU), ERR_PARAM_INVALID);
    }else if(NOT_PMU_TEMPERATURE_LEVEL(temp_level)){
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x000eU), ERR_PARAM_INVALID);
    }else
#endif
    {
        if(PMU_TEMPERATURE_MONITOR_0 == temp_monitor){
            if(PMU_TEMPERATURE_LEVEL_145 == temp_level){
                PMU_CFG &= ~PMU_CFG_TEMP0SEL;
            }else{
                PMU_CFG |= PMU_CFG_TEMP0SEL;
            }
        }else{
            if(PMU_TEMPERATURE_LEVEL_145 == temp_level){
                PMU_CFG &= ~PMU_CFG_TEMP1SEL;
            }else{
                PMU_CFG |= PMU_CFG_TEMP1SEL;
            }
        }
    }
}

/*!
    \brief      set clock state when enter standby mode (API_ID(0x000fU))
    \param[in]  clk_src: clock source
                only one parameter can be selected which is shown as below:
      \arg        PMU_CLK_IRC48M: clock source is IRC48M
      \arg        PMU_CLK_IRC40K: clock source is IRC40K
    \param[in]  state: clock state in standby mode
                only one parameter can be selected which is shown as below:
      \arg        ENABLE: clock is on in standby mode
      \arg        DISABLE: clock is off in standby mode
    \param[out] none
    \retval     none
*/
void pmu_standby_clock_state_set(uint32_t clk_src, ControlStatus state)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_CLK_SOURCE(clk_src)){
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x000fU), ERR_PARAM_INVALID);
    }else if(NOT_CONTROL_STATUS(state)){
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x000fU), ERR_PARAM_INVALID);
    }else
#endif
    {
        if(PMU_CLK_IRC48M == clk_src){
            if(ENABLE == state){
                PMU_CFG |= PMU_CFG_STBIRC48MCTL;
            }else{
                PMU_CFG &= ~PMU_CFG_STBIRC48MCTL;
            }
        }else{
            if(ENABLE == state){
                PMU_CFG |= PMU_CFG_STBIRC40KCTL;
            }else{
                PMU_CFG &= ~PMU_CFG_STBIRC40KCTL;
            }
        }
    }
}

/*!
    \brief      start PMU analog BIST (API_ID: 0x0010U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_analog_bist_start(void)
{
    PMU_ABCTL = PMU_ABCTL_ABEN;
}

/*!
    \brief      write PMU control key (API_ID: 0x0011U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_control_key_write(void)
{
    PMU_CTLKEY = PMU_CTL_KEY_VLE;
    PMU_CTLKEY = (~PMU_CTL_KEY_VLE) & PMU_CTLKEY_CTLKEY;
}

/*!
    \brief      enable PMU mode update (API_ID: 0x0012U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_mode_update_enable(void)
{
    PMU_MODUPD = PMU_MODUPD_MODUPD;
}


/*!
    \brief      request system reset (API_ID: 0x0013U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_system_reset_request(void)
{
    /* set system reset request */
    PMU_MODCFG |= PMU_MODCFG_SRSTR;
    /* enable mode update */
    PMU_MODUPD = PMU_MODUPD_MODUPD;
    /* write control key */
    PMU_CTLKEY = PMU_CTL_KEY_VLE;
    PMU_CTLKEY = (~PMU_CTL_KEY_VLE) & PMU_CTLKEY_CTLKEY;
}

/*!
    \brief      request subsystem reset (API_ID: 0x0014U)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_subsystem_reset_request(void)
{
    /* set subsystem reset request */
    PMU_MODCFG |= PMU_MODCFG_SSRSTR;
    /* enable mode update */
    PMU_MODUPD = PMU_MODUPD_MODUPD;
    /* write control key */
    PMU_CTLKEY = PMU_CTL_KEY_VLE;
    PMU_CTLKEY = (~PMU_CTL_KEY_VLE) & PMU_CTLKEY_CTLKEY;
}

/*!
    \brief      set PMU core boot address (API_ID(0x0015U))
    \param[in]  core_id: core id
                only one parameter can be selected which is shown as below:
      \arg        PMU_CORE_ID_0: main core id 0
      \arg        PMU_CORE_ID_1: main core id 1
    \param[in]  boot_addr: boot address
    \param[out] none
    \retval     none
*/
void pmu_core_boot_address_set(uint32_t core_id, uint32_t boot_addr)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CORE_ID(core_id)){
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    }else
#endif
    {
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        if(PMU_CORE_ID_0 == core_id){
            PMU_C0BTADDR = boot_addr;
        }else{
            PMU_C1BTADDR = boot_addr;
        }
#else
        PMU_C0BTADDR = boot_addr;
#endif
    }
}

#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
/*!
    \brief      set PMU main core id (API_ID(0x0016U))
    \param[in]  core_id: core id
                only one parameter can be selected which is shown as below:
      \arg        PMU_CORE_ID_0: main core id 0
      \arg        PMU_CORE_ID_1: main core id 1
    \param[out] none
    \retval     none
*/
void pmu_main_core_id_set(uint32_t core_id)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_CORE_ID(core_id)){
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0016U), ERR_PARAM_INVALID);
    }else
#endif
    {
        PMU_MCID = core_id;
    }
}

/*!
    \brief      get PMU main core id (API_ID: 0x0017U)
    \param[in]  none
    \param[out] none
    \retval     core id
      \arg        PMU_CORE_ID_0: main core id 0
      \arg        PMU_CORE_ID_1: main core id 1
*/
uint32_t pmu_main_core_id_get(void)
{
    uint32_t core_id;

    core_id = PMU_MCID & PMU_MCID_MCID;

    return core_id;
}
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */

/*!
    \brief      enable PMU core update (API_ID: 0x0018U) 
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_core_update_enable(void)
{
    PMU_CUPD = PMU_CUPD_CUPD;
}

/*!
    \brief      pmu work in standby mode (API_ID: 0x0019U) 
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_to_standbymode(void)
{
    /* set standby request */
    PMU_MODCFG |= PMU_MODCFG_STBR;
    /* enable mode update */
    PMU_MODUPD = PMU_MODUPD_MODUPD;
    /* write control key */
    PMU_CTLKEY = PMU_CTL_KEY_VLE;
    PMU_CTLKEY = (~PMU_CTL_KEY_VLE) & PMU_CTLKEY_CTLKEY;

