sorosaulong-ux/gd32-test-project/Library/gd32a7xx_pmu.c
    /* reset wakeup flag */
    PMU_LVCS = PMU_LVCS_PORF;

    /* set sleepdeep bit of Cortex-M7 system control register */
    SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;

    /* select WFI or WFE command to enter standby mode */
    __WFI();
}

/*!
    \brief      get previous mode (API_ID: 0x001aU)
    \param[in]  none
    \param[out] none
    \retval     previous mode
      \arg        PMU_PRE_MODE_RESET: previous mode was reset (any reset)
      \arg        PMU_PRE_MODE_STANDBY: previous mode was standby mode
*/
uint32_t pmu_previous_mode_get(void)
{
    uint32_t mode;
    
    mode = PMU_MODSTAT & PMU_MODSTAT_PREMOD;
    
    return mode;
}

/*!
    \brief      enable write access to the registers in backup domain (API_ID: 0x001bU) 
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_backup_write_enable(void)
{
    PMU_CTL |= PMU_CTL_BKPWEN;
}

/*!
    \brief      disable write access to the registers in backup domain (API_ID: 0x001cU) 
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_backup_write_disable(void)
{
    PMU_CTL &= ~PMU_CTL_BKPWEN;
}

/*!
    \brief      clear all LVCS register flags (API_ID: 0x001dU)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void pmu_all_flags_clear(void)
{
    PMU_LVCS = (uint32_t)0xFFFFFFFFU;
}

/*!
    \brief      get PMU flag (API_ID(0x001eU))
    \param[in]  flag: the pmu flag bits
                only one parameter can be selected which are shown as below:
      \arg        PMU_FLAG_VAHVDF: VDDA domain HVD flag
      \arg        PMU_FLAG_VBHVDF: VDDB domain HVD flag
      \arg        PMU_FLAG_V25HVDF: V25 domain HVD flag 
      \arg        PMU_FLAG_V11HVDF: V11 domain HVD flag 
      \arg        PMU_FLAG_V5ALVDF: VDDA domain 5V LVD flag
      \arg        PMU_FLAG_V15LVDF: V15 domain LVD flag
      \arg        PMU_FLAG_TMP0IF: temperature monitor 0 interrupt flag 
      \arg        PMU_FLAG_TMP1IF: temperature monitor 1 interrupt flag 
      \arg        PMU_FLAG_VAHVDSF: VDDA domain HVD status flag
      \arg        PMU_FLAG_VBHVDSF: VDDB domain HVD status flag
      \arg        PMU_FLAG_V25HVDSF: V25 domain HVD status flag 
      \arg        PMU_FLAG_V11HVDSF: V11 domain HVD status flag 
      \arg        PMU_FLAG_V5ALVDSF: VDDA domain 5V LVD status flag
      \arg        PMU_FLAG_V15LVDSF: V15 domain LVD status flag
      \arg        PMU_FLAG_TPM0OF: temperature monitor 0 output flag
      \arg        PMU_FLAG_TPM1OF: temperature monitor 1 output flag
      \arg        PMU_FLAG_VALVRNF: VDDA domain LVR NCM flag 
      \arg        PMU_FLAG_VALVRNLF: VDDA domain LVR NCM or LCM flag  
      \arg        PMU_FLAG_VBLVRNF: VDDB domain LVR NCM flag 
      \arg        PMU_FLAG_VBLVRNLF: VDDB domain LVR NCM or LCM flag 
      \arg        PMU_FLAG_V25LVRNF: V25 domain LVR NCM flag 
      \arg        PMU_FLAG_V25LVRNLF: V25 domain LVR NCM or LCM flag 
      \arg        PMU_FLAG_V11LVRNF: V11 domain LVR NCM flag  
      \arg        PMU_FLAG_V11LVRNLF: V11 domain LVR NCM or LCM flag  
      \arg        PMU_FLAG_V15HVDF: V15 domain HVD flag 
      \arg        PMU_FLAG_V15HVDSF: V15 domain HVD status flag 
      \arg        PMU_FLAG_IRC48MSTBF: IRC48M stabilization status flag 
      \arg        PMU_FLAG_IRC40KSTBF: IRC40K stabilization status flag 
      \arg        PMU_FLAG_PORF: POR flag
      \arg        PMU_FLAG_FSRSF: final step regulator status flag
      \arg        PMU_FLAG_V11RUNABF: V11 run ABIST test flag 
      \arg        PMU_FLAG_V11STBABF: V11 standby ABIST test flag 
      \arg        PMU_FLAG_V25ABF: V25 ABIST test flag
      \arg        PMU_FLAG_VAABF: VDDA ABIST test flag
      \arg        PMU_FLAG_VBABF: VDDB ABIST test flag
      \arg        PMU_FLAG_TEMP0ABF: high temperature 0 flag
      \arg        PMU_FLAG_TEMP1ABF: high temperature 1 flag
      \arg        PMU_FLAG_HVDV11ABF: HVD V11 ABIST test flag
      \arg        PMU_FLAG_HVDV25ABF: HVD V25 ABIST test flag
      \arg        PMU_FLAG_HVDVAABF: HVD VDDA ABIST test flag
      \arg        PMU_FLAG_HVDVBABF: HVD VDDB ABIST test flag
    \param[out] none
    \retval     FlagStatus: status of flag (RESET or SET)
*/
FlagStatus pmu_flag_get(pmu_flag_enum flag)
{
    FlagStatus status ;

    if(0U != (PMU_REG_VAL(flag) & BIT(PMU_BIT_POS(flag)))){
        status = SET;
    } else {
        status = RESET;
    }
    
    return status;
}

/*!
    \brief      clear PMU flag (API_ID(0x001fU))
    \param[in]  flag: the pmu flag bits
                only one parameter can be selected which are shown as below:
      \arg        PMU_FLAG_VAHVDF: VDDA domain HVD flag
      \arg        PMU_FLAG_VBHVDF: VDDB domain HVD flag
      \arg        PMU_FLAG_V25HVDF: V25 domain HVD flag 
      \arg        PMU_FLAG_V11HVDF: V11 domain HVD flag 
      \arg        PMU_FLAG_V5ALVDF: VDDA domain 5V LVD flag
      \arg        PMU_FLAG_TMP0IF: temperature monitor 0 interrupt flag 
      \arg        PMU_FLAG_TMP1IF: temperature monitor 1 interrupt flag 
      \arg        PMU_FLAG_V15LVDF: V15 domain LVD flag
      \arg        PMU_FLAG_VALVRNF: VDDA domain LVR NCM flag 
      \arg        PMU_FLAG_VALVRNLF: VDDA domain LVR NCM or LCM flag  
      \arg        PMU_FLAG_VBLVRNF: VDDB domain LVR NCM flag 
      \arg        PMU_FLAG_VBLVRNLF: VDDB domain LVR NCM or LCM flag 
      \arg        PMU_FLAG_V25LVRNF: V25 domain LVR NCM flag 
      \arg        PMU_FLAG_V25LVRNLF: V25 domain LVR NCM or LCM flag 
      \arg        PMU_FLAG_V11LVRNF: V11 domain LVR NCM flag  
      \arg        PMU_FLAG_V11LVRNLF: V11 domain LVR NCM or LCM flag  
      \arg        PMU_FLAG_V15HVDF: V15 domain HVD flag 
      \arg        PMU_FLAG_PORF: VDDA domain HVD flag
      \arg        PMU_FLAG_FSRSF: final step regulator status flag
      \arg        PMU_FLAG_V11RUNABF: V11 run ABIST test flag 
      \arg        PMU_FLAG_V11STBABF: V11 standby ABIST test flag 
      \arg        PMU_FLAG_V25ABF: V25 ABIST test flag
      \arg        PMU_FLAG_VAABF: VDDA ABIST test flag
      \arg        PMU_FLAG_VBABF: VDDB ABIST test flag
      \arg        PMU_FLAG_TEMP0ABF: high temperature 0 flag
      \arg        PMU_FLAG_TEMP1ABF: high temperature 1 flag
      \arg        PMU_FLAG_HVDV11ABF: HVD V11 ABIST test flag
      \arg        PMU_FLAG_HVDV25ABF: HVD V25 ABIST test flag
      \arg        PMU_FLAG_HVDVAABF: HVD VDDA ABIST test flag
      \arg        PMU_FLAG_HVDVBABF: HVD VDDB ABIST test flag
    \param[out] none
    \retval     none
*/
void pmu_flag_clear(pmu_flag_enum flag)
{
    PMU_REG_VAL(flag) = BIT(PMU_BIT_POS(flag));
}

/*!
    \brief      get PMU interrupt flag (API_ID(0x0020U))
    \param[in]  int_flag: the pmu interrupt flag bits
                only one parameter can be selected which are shown as below:
      \arg        PMU_INT_FLAG_VAHVD : VDDA domain HVD interrupt flag
      \arg        PMU_INT_FLAG_VBHVD : VDDB domain HVD interrupt flag
      \arg        PMU_INT_FLAG_V25HVD: V25 domain HVD interrupt flag 
      \arg        PMU_INT_FLAG_V11HVD: V11 domain HVD interrupt flag 
      \arg        PMU_INT_FLAG_V15HVD: V15 domain HVD interrupt flag 
      \arg        PMU_INT_FLAG_V5ALVD: VDDA domain 5V LVD interrupt flag
      \arg        PMU_INT_FLAG_V15LVD: V15 domain LVD interrupt flag
      \arg        PMU_INT_FLAG_TMP0: temperature monitor 0 interrupt flag
      \arg        PMU_INT_FLAG_TMP1: temperature monitor 1 interrupt flag
    \param[out] none
    \retval     FlagStatus: status of flag (RESET or SET)
*/
FlagStatus pmu_interrupt_flag_get(uint32_t int_flag)
{
    FlagStatus status = RESET;

