sorosaulong-ux/gd32-test-project/Library/gd32a7xx_pmu.c
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_INTERRUPT(int_flag)){
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0020U), ERR_PARAM_INVALID);
    }else
#endif
    {
        if(0U != (PMU_LVCS & int_flag)){
            status = SET;
        } else {
            status = RESET;
        }
    }
    
    return status;
}

/*!
    \brief      clear PMU interrupt flag (API_ID(0x0021U))
    \param[in]  int_flag: the pmu interrupt flag bits
                only one parameter can be selected which are shown as below:
      \arg        PMU_INT_FLAG_VAHVD : VDDA domain HVD interrupt flag
      \arg        PMU_INT_FLAG_VBHVD : VDDB domain HVD interrupt flag
      \arg        PMU_INT_FLAG_V25HVD: V25 domain HVD interrupt flag 
      \arg        PMU_INT_FLAG_V11HVD: V11 domain HVD interrupt flag 
      \arg        PMU_INT_FLAG_V15HVD: V15 domain HVD interrupt flag 
      \arg        PMU_INT_FLAG_V5ALVD: VDDA domain 5V LVD interrupt flag
      \arg        PMU_INT_FLAG_V15LVD: V15 domain LVD interrupt flag
      \arg        PMU_INT_FLAG_TMP0: temperature monitor 0 interrupt flag
      \arg        PMU_INT_FLAG_TMP1: temperature monitor 1 interrupt flag
    \param[out] none
    \retval     none
*/
void pmu_interrupt_flag_clear(uint32_t int_flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_INTERRUPT(int_flag)){
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0021U), ERR_PARAM_INVALID);
    }else
#endif
    {
        PMU_LVCS = int_flag;
    }
}

/*!
    \brief      enable the PMU interrupt (API_ID(0x0022U))
    \param[in]  interrupt: specify which interrupt to enable
                only one parameter can be selected which are shown as below:
      \arg        PMU_INT_HVD: high voltage detect interrupt
      \arg        PMU_INT_LVD: low voltage detect interrupt
      \arg        PMU_INT_TMP: temperature monitor detect interrupt
    \param[out] none
    \retval     none
*/
void pmu_interrupt_enable(uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_INTERRUPT_ENABLE(interrupt)){
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0022U), ERR_PARAM_INVALID);
    }else
#endif
    {
        PMU_CFG |= interrupt;
    }
}

/*!
    \brief      disable the PMU interrupt (API_ID(0x0023U))
    \param[in]  interrupt: specify which interrupt to enable
                only one parameter can be selected which are shown as below:
      \arg        PMU_INT_HVD: high voltage detect interrupt
      \arg        PMU_INT_LVD: low voltage detect interrupt
      \arg        PMU_INT_TMP: temperature monitor detect interrupt
    \param[out] none
    \retval     none
*/
void pmu_interrupt_disable(uint32_t interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_PMU_INTERRUPT_ENABLE(interrupt)){
        fw_debug_report_err(PMU_MODULE_ID, API_ID(0x0023U), ERR_PARAM_INVALID);
    }else
#endif
    {
        PMU_CFG &= ~interrupt;
    }
}

